configuration/src/InformationRegisters/НепросмотренныеКомментарии/НепросмотренныеКомментарии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НепросмотренныеКомментарии</name>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторКомментария</name>
    <comment>Идентификатор комментария</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/НепросмотренныеКомментарии/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет записи по новым комментариям для участников оповещений в регистр
//
// Параметры:
//  ИдентификаторКомментария  - Уникальный идентификатор - идентификатор комментария в РС.Комментарии
//  Пользователи  - Массив - список пользователей, которым добавятся непросмотренные комментарии
//
Процедура ДобавитьНепросмотренные(Знач ИдентификаторКомментария, Знач Пользователи) Экспорт
	
	Для Каждого Пользователь Из Пользователи Цикл
		Добавить(ИдентификаторКомментария, Пользователь);
	КонецЦикла;
		
КонецПроцедуры

// Удаляет записи после просмотра комментариев в форме
//
// Параметры:
//  Идентификаторы  - Массив - список идентификаторов
//
Процедура УдалитьПросмотренные(Знач Идентификаторы) Экспорт
	
	Для Каждого ИдентификаторКомментария Из Идентификаторы Цикл
		Удалить(ИдентификаторКомментария);
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Добавляет запись регистра
//
// Параметры:
//  ИдентификаторКомментария  - Уникальный идентификатор - идентификатор комментария в РС.Комментарии
//  Пользователь  - СправочникСсылка.Пользователи - пользователь, для которого добавляется запись
//
Процедура Добавить(Знач ИдентификаторКомментария, Знач Пользователь)
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Пользователь = Пользователь;	
	МенеджерЗаписи.Идентификатор = ИдентификаторКомментария;	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Удаляет запись регистра
//
// Параметры:
//  ИдентификаторКомментария  - Уникальный идентификатор - идентификатор комментария в РС.Комментарии
//
Процедура Удалить(Знач ИдентификаторКомментария)
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;	
	МенеджерЗаписи.Идентификатор = ИдентификаторКомментария;
	
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Удалить();
	КонецЕсли;			

КонецПроцедуры

#КонецОбласти

#КонецЕсли
